{
	"nav-bar": "############################################################ navbar ###########################################",
	"home": "Home",
	"about": "About",
	"services": "Services",
	"projects": "Projects",
	"investors": "Investors",
	"contact": "Contact",
	"index page": "#####################################################   index page ##########################################",
	"mission": "Our Missions",
	"mission text": "Achieving sustainable growth in our business is central to our business objective and in doing so, we have formulated a series of strategies.",
	"ample experience": "Ample Mega-project Experience",
	"ample exp text": "We are a contractor having a long history of undertaking construction works in Hong Kong, with more than 26 years of operation. We have completed a number of large scale civil engineering projects, including the Ten Major Infrastructure Projects.",
	"effective desc": "Effective, Seasoned and Stable Team",
	"effective team desc": "We have ahighly-educated, qualified and effecitve management team who are dedicated in the construction industry in Hong Kong",
	"timeliness": "Timeliness of Project Completion",
	"timeliness desc": "Our success is founded on our vigorous efforts to complete projects on time. We emphasise strongly the importance of tight progress management of projects",
	"clients": "Our Clients",
	"footer": "footer section",
	"Landrich Holding Limited": "Landrich Holding Limited",
	"stock code": "(SEHK Stock Code: 2132)",
	"subsidiaries": "Principal wholly-owned subsidiaries:",
	"REL": "Richwell Engineering Limited",
	"RCEL": "Richwell Civil Engineering Limited",
	"TCCL": "Time Concept Construction Limited",
	"contact us": "Contact us",
	"tel": "Tel: 2430 0018",
	"fax": "Fax: 2430 0181",
	"LH email": "Email: ",
	"address": "Address: Unit 2808 28/F The Octagon 6 Sha Tsui Road Tsuen Wan NT HK",
	"disclaimer": "Disclaimer",
	"copyright": "Copyright Landrich Holding Limited",
	"about page": "################################################################     About Page   #######################################",
	"company profile": "Company Profile",
	"company profile des": "We are a contractor having a long history of undertaking construction works in Hong Kong. We are able to undertake civil engineering works as either a main contractor or a subcontractor. Our civil engineering projects can be broadly classified as roads and drainage works and site formation works. We also offered building works. We are registered on the Approved Contractors List maintained by the Development Bureau in the categories of Site Formation (Group B (Probation)), Roads and Drainage (Group B (Probation)) and Roads and Drainage (Group C (Probation)), which enable us to directly tender for public works contracts in these works categories with various. The operating subsidiaries of our Company are also registered as registered subcontractors under the Subcontractors Registration Scheme of the Construction Industry Council (CIC).",
	"principal business": "Principal Business",
	"principal business des-1": "We principally provide civil engineering works which can be broadly categorised as (i) roads and drainage works; and (ii) site formation works. We also perform building works.",
	"principal business des-2": "Our Group’s operations on sites are subject to certain environmental requirements pursuant to the laws in Hong Kong, such as Air Pollution Control Ordinance, Noise Control Ordinance, Water Pollution Control Ordinance and Waste Disposal Ordinance. We are committed to minimising the adverse impact to the environment caused by our business operations and we have implemented an environmental management system which was certified to be in compliance with the standard required under ISO 14001: 2015.",
	"principal business des-3": "We hold various licences and qualifications in respect of our operation. We also hold all necessary licenses and qualifications which are material to our business.",
	"principal business des-4": "The Directors believe that the listing on the Main Board of The Stock Exchange of Hong Kong Limited has been our key milestone over many years of development, followed a series of progressive acheivements: registering in the Group B (Probation) under the Site Formation and Roads and Drainage categories in 2007 and 2009, respectively, promotion from Group B (Probation) to Group B (confirmed) and Group C (Probation) under the Roads and Drainage category in 2014 and 2016, respectively, and further registering in Group B (Probation) under the Roads and Drainage category in 2018. The listing will certain create new value to Landrich and will lead us to the next level of growth potential.",
	"board": "Board",
	"BoD": "Board of Directors",
	"EDs": "Executive Directors",
	"KK Tsui": "Mr. Tsui Kai Kwong",
	"Ian Tsui": "Mr. Tsui Tsz Yeung Ian",
	"Janis Tsui": "Ms. Tsui Wai Yeung Janis",
	"INEDs": "Independent Non-executive Directors",
	"Lee Yan Kit": "Mr. Lee Yan Kit",
	"Lee Kin Kee": "Mr. Lee Kin Kee",
	"Derek Kwong": "Mr. Kwong Ping Man",
	"milestones": "Milestones",
	"Year": "Year",
	"Event": "Event",
	"1993 event": "Richwell Engineering commenced its operation of undertaking construction engineering works in Hong Kong",
	"2006 event": "Richwell Engineering was awarded the role as subcontractor in the back span construction of the Stonecutters Bridge project with initial contract value exceeding HK$120 million",
	"2007 event": "Richwell Engineering was admitted as an approved contractor on the Approved Contractors List in the category of Site Formation under Group B (Probation)",
	"2009 event-1": "Richwell CE commenced its operation of undertaking construction engineering works in Hong Kong",
	"2009 event-2": "Richwell Engineering (as one of the partners in the consortium with Build King Group) was awarded the role as main contractor in stage 1 of the Kai Tak Development project with initial contract value exceeding HK$120 million.",
	"2009 event-3": "Richwell Engineering was admitted as an approved contractor on the Approved Contractors List in the category of Roads and Drainage under Group B (Probation)",
	"2013 event": "Richwell Engineering was awarded the role as sole main contractor in the Yuet Wah Street Pedestrian Linkage project",
	"2014 event-1": "Time Concept commenced its operation of undertaking construction subcontracting works in Hong Kong",
	"2014 event-2": "Richwell Engineering was promoted to Group B (Confirmed) on the Approved Contractors List in the category of Roads and Drainage",
	"2016 event": "Richwell Engineering was promoted to Group C (Probation) on the Approved Contractors List in the category of Roads and Drainage",
	"2018 event": "Richwell CE was admitted as an approved contractor on the Approved Contractors List in the category of Roads and Drainage under Group B (Probation)",
	"2019 event": "Richwell Engineering (as one of the partners with Build King Group) was awarded the role as main contractor in Kwu Tung North New Development Area project with initial contract value exceeding HK$770 million",
	"2020 event": "Landrich Holding Limited is listed on the Main Board of Hong Kong Stock Exchange on 20 October 2020, the Stock Code is 2132",
	"Strengths": "Strengths",
	"Compet Strengths": "Our Competitive Strengths",
	"strength-1": "Long established and have solid experience in undertaking large scale construction projects",
	"strength-2": "Have an experienced, stable and highly dedicated management team and a team of personnel with good academic background and qualification for project execution",
	"strength-3": "Emphasise timeliness for completion of projects",
	"strength-4": "Have long-standing customer relationships",
	"Certificates": "Certificates",
	"licenses permits": "Certificates and Registrations",
	"RCEL ISO9001": "ISO9001:2015",
	"REL ISO14001": "ISO14001:2015",
	"Services page": "#######################################################   Services Page   ##############################################",
	"CEBC": "Civil Engineering and Building Construction",
	"our target": "We overcome challenges and deliver great results!",
	"RnD": "Roads and Drainage",
	"RnD des": "Construction of trunk roads, carriageway, bridges, tunnels and modification of existing roads, also include landscaping works, laying of pipes and manhole construction.",
	"SF": "Site Formation",
	"SF des": "Clearance of construction site, demolition of existing structures, reduction and stabilisation of existing slopes, and associated work, also include the establishment of fill tank for the storage of public fill materials arising from construction activities.",
	"Build Con": "Building Contruction",
	"Build Con des": "Construction of building, mainly structural steel works, transportation and heavy lifting works，as well as construction of reinforced concrete structures.",
	"Main Contractor": "Main Contractor",
	"Main Con des": "Registered on the List of Approved Contractors for Public Works under Roads and Drinage (Group B and Group C (Probation)) and Site Formation cetegories (Group B (Probation)).",
	"Subcontractor": "Subcontractor",
	"subcon des": "Possessing different types of heavy plant and machinery and a team of experienced project management staff, we are capable of completing different civil engineering and building construction projects.",
	"projects page": "############################################################    Projects Page    ######################################################",
	"projects completed": "Select Completed Projects",
	"Stonecutters Bridge Project": "Stonecutters Bridge Project",
	"Liangtang Project": "Liantang Port / Heung Yuen Wai Boundary Control Point",
	"Bridge Construction": "Bridge Construction",
	"Kai Tak I Project": "Kai Tak Development State I Infrastructure Works",
	"Aug 2013": "Aug 2013",
	"Tolo Highway Project": "Widening of Tolo Highway / Fanling Highway",
	"Jun 2013": "Jun 2013",
	"Apr 2019": "Apr 2019",
	"KZM Bridge Project": "Hong Kong-Zhuhai-Macao Bridge Hong Kong Boundary Crossing Facilities",
	"Subsidied Housing Project": "Development of Subsidised Housing",
	"SF RnD": "Site formation and road and drainage",
	"Feb 2019": "Feb 2019",
	"TM CLK Link Project": "Tuen Mun–Chek Lap Kok Link",
	"Yuet Wah St Project": "Yuet Wah Street Pedestrian Linkage",
	"Barrier-free Project": "Provision of Barrier-free Access Facilities for Highway Structures",
	"Kai Tak 3A Project": "Kai Tak Redevelopment – Phase 3A Infrastructure Facilities",
	"Jul 2018": "Jul 2018",
	"Jun 2018": "Jun 2018",
	"PolyU Project": "Structural steel works for the building construction at PolyU",
	"Sep 2017": "Sep 2017",
	"Central Bypass Project": "Central Bypass road works",
	"Nov 2016": "Nov 2016",
	"tunnel structure": "Tunnel concrete structure",
	"Kwun Tong Project": "Yuet Wah Street Pedestrian Linkage",
	"Aug 2017": "Aug 2017",
	"24 Lift Project": "Provision of Barrier-free Access Facilities for Highway Structures",
	"Nov 2018": "Nov 2018",
	"1112 Project": "Hung Hom Station and Stabling Sidings (Contract No. 1112)",
	"Universal Access Project": "Provision of Universal Access Facilities for Highway Structures",
	"Nov 2020": "Nov 2020",
	"18 Lift Project": "Provision of Barrier-free Access Facilities for Highway Structures",
	"KZM Link Project": "Hong Kong-Zhuhai-Macao Bridge Hong Kong Link Road",
	"C4 Project": "Construction of buildings and facilities for the TM-CLKL Northern Connection",
	"Oct 2020": "Oct 2020",
	"IR Page": "##################################################################### IR Page #########################################################",
	"Investor Relations": "Investor Relations",
	"Announcements": "Announcements",
	"Circulars": "Circulars",
	"Financials": "Financials",
	"Other Returns": "Other Returns",
	"Prospectus": "Prospectus",
	"CG": "Corporate Governance",
	"Date": "Date",
	"Title": "Title",
	"no ann": "No anouncement published.",
	"no cir": "No circular published.",
	"Financial Reports": "Financial Reports",
	"no fin": "No financial reports published.",
	"no returns": "No other returns published.",
	"Formal Notice": "Formal Notice",
	"Share Offer": "Share Offer",
	"Board Committees": "Board Committees",
	"AC ToR": "Audit Committee – Terms of Reference",
	"NC ToR": "Nomination Committee – Terms of Reference",
	"RC ToR": "Remuneration Committee – Terms of Reference",
	"Director roles and functions": "List of Directors and their Roles and Functions",
	"MnA": "Amended and Restated Memorandum and Articles of Association",
	"Dir Nom": "Procedures for Director's Nomination",
	"Share Offer - Allotment Results": "Share Offer - Allotment Results",
	"Monthly Return": "Monthly Return of Equity Issuer on Movements in Securities",
	"Contact Page": "###############################################################   Contact Page   ###################################################",
	"leave message": "Leave us a message",
	"if have comments": "If you have any enquiries or comments, please fill in the following form to contact us",
	"Name": "Name",
	"Phone": "Phone",
	"Email": "Email",
	"Subject": "Subject",
	"Content": "Content",
	"declare accurate": "I declare all information above is true and accurate.",
	"Submit": "Submit",
	"Reset": "Reset",
	"Disclaimer page": "#########################################################     Disclaimer Page    ############################################",
	"disclaim p1": "The information on this website is intended to be for reference purposes only. It does not intend to provide comprehensive information or any investment or other professional advice. It shall not constitute any undertaking or offer made by Landrich Holding Limited or affiliated companies. Landrich Holding Limited endeavors to ensure the information provided is accurate and reliable. However, Landrich Holding Limited does not warrant or represent (whether expressly or impliedly) that such information is correct, complete, reliable, timely or not misleading. Landrich Holding Limited also does not guarantee for non-infringement, security, fitness for purpose, virus-free of such information or other websites linked to or access via this website. One is responsible for any damage or loss for inaccuracy or omission, or any decision, action or inaction in reliance on any information on this website, using or entering into this website or any website linked or access via this website. And Landrich Holding Limited and / or its affiliated companies accept no liabilities (whether tort or contractual or other liabilities).",
	"disclaim p2": "If there is any conflict or inconsistency between the English and Chinese versions, the English version will prevail. Landrich Holding Limited has the rights including to modify, update, interpret the content contained in this website and may from time to time modify or update the content contained in this website.",
	"Intellectual Property": "Intellectual Property",
	"disclaim p3": "Unless source is otherwise indicated, Landrich Holding Limited owns the copyright and any other intellectual property of all the content on this website. Landrich Holding Limited has not authorized any third party to use, reproduce, copy and modify or otherwise use the content of this website. No part of any contents on this website may be copied, distributed, displayed, modified or reproduced or used in any way, without the written consent of Landrich Holding Limited.",
	"declare privacy": "Declaration of Privacy Policy",
	"disclaim p4": "Landrich Holding Limited commits to duly handle personal data to protect privacy pursuant to the 'Personal Data (Privacy) Ordinance' (Chapter 486 of the Laws of Hong Kong).",
	"disclaim p5": "Unless otherwise stated, we will record your visit and your IP Address. We will not collect any personally identifiable information when you browse our website. Cookies (if any) used in any part of our website will not be deployed for collecting personal information. Cookies can be stored in the web surfers' computers for obtaining configuration information and analyzing browsing habits of the web surfers. You may modify relevant internet options or setting of browsing preferences to refuse to accept Cookies. However, you may not be able to use or activate certain functions provided by our website. Our website may intercept users who do not accept Cookies.",
	"disclaim p6": "At times of using our website, you may be asked to provide your personally identifiable information. Such information is essential for the services and activities provided by our website. If you fail to provide the information needed, we will not be able to provide the services of our website to you.",
	"disclaim p7": "The information we collect will be used for the following purposes:",
	"disclaim p8": "Monitoring the operation of our website and facilitate its further development;",
	"disclaim p9": "Compiling aggregate statistics of our users for analysis of our use of our website;",
	"disclaim p10": "Identifying and verifying the identity of the users of the services provided on our website; and/or",
	"disclaim p11": "Communicating with users on matters relating to or arising from the use of the services on our website.",
	"disclaim p12": "Personal data held by us will be kept confidential but we may provide such information:",
	"disclaim p13": "where such disclosure is authorised or required by law, regulations or rules;",
	"disclaim p14": "in response to requests by agency or organisation relating to law enforcement purposes;",
	"disclaim p15": "to employees, related companies, including subsidiaries and associated companies, insurers, business partners, agents, independent contractors, business associates and service providers as required for any of the above stated purposes; or",
	"disclaim p16": "to any other person or organisation who assists in our operations and such person or corporation shall be under a duty of confidentiality to us which has undertaken to keep such information confidential.",
	"disclaim p17": "You have the right to access or correct your personal data pursuant to the 'Personal Data (Privacy) Ordinance' (Chapter 486 of the Laws of Hong Kong). Request for access or correction of your personal information should be addressed to us in writing and sent by post to us."
}